
<policyDefinitionResources revision="1.0" schemaVersion="1.0">

  <displayName>
  </displayName>
  <description>
  </description>

  <resources>
    <stringTable>
      <string id="Name_ECSCommunicationEnabled">Povolit komunikaci a stáhnout experimenty</string>
      <string id="Sup_EdgeUpdate1_3_133_3">Microsoft Edge Update 1.3.133.3 a novější</string>
      <string id="Pol_ProxyMode">Zvolit způsob nastavení proxy serveru</string>
      <string id="Name_ForceInstallsMachine">Vynutit instalace (pro celý počítač)</string>
      <string id="Name_ManualUpdatesOnly">Jen ruční aktualizace</string>
      <string id="Pol_EdgePreview">Povolit registraci uživatelů v Program Windows Insider v Edgi Preview</string>
      <string id="Sup_GoogleUpdate1_3_21_81">Microsoft Edge Update 1.3.21.81 a novější</string>
      <string id="Explain_Applications">Pro podporu aplikací Edge vydaných v budoucnu se bude vyžadovat aktualizovaná šablona ADMX/ADML.</string>
      <string id="Name_DesktopShortcutDisabled">Zabránit vytvoření zástupce na ploše při instalaci</string>
      <string id="Pol_DefaultRemoveDesktopShortcut">Při aktualizaci výchozího nastavení odebrat zástupce na ploše</string>
      <string id="TargetChannel_Dev_DropDown">Dev</string>
      <string id="Pol_ECSControl">Řízení komunikace aktualizačního nástroje se Službou experimentálních funkcí a konfigurace</string>
      <string id="Explain_ECSControl">V rámci aktualizace Microsoft Edge se Služba experimentálních funkcí a konfigurace používá k nasazení datové části experimentování.

Datová část experimentování se skládá ze seznamu funkcí v rané fázi vývoje, u kterých Microsoft povoluje testování a zpětnou vazbu.

Pokud tuto zásadu povolíte, ze Služby experimentálních funkcí a konfigurace se stáhne datová část experimentování.

Pokud tuto zásadu zakážete, komunikace se Službou experimentálních funkcí a konfigurace se úplně zastaví.

Pokud tuto zásadu nenakonfigurujete, spravovaná zařízení se budou chovat stejně, jako kdyby byla zásada zakázaná.

Pokud tuto zásadu nenakonfigurujete, nespravovaná zařízení se budou chovat stejně, jako kdyby byla zásada povolená.</string>
      <string id="Name_InstallsDisabled">Instalace zakázány</string>
      <string id="Pol_TargetChannel">Přepsání cílového kanálu</string>
      <string id="Pol_AllowInstallation">Povolit instalaci</string>
      <string id="ProxyFixedServers_DropDown">Používat pevné proxy servery</string>
      <string id="Explain_CreateDesktopShortcut">Pokud povolíte tuto zásadu, vytvoří se při instalaci aplikace Microsoft Edge zástupce na ploše.
  Pokud tuto zásadu zakážete, nevytvoří se při instalaci aplikace Microsoft Edge žádný zástupce na ploše.
  Pokud tuto zásadu nenakonfigurujete, vytvoří se při instalaci aplikace Microsoft Edge zástupce na ploše.
Pokud je aplikace Microsoft Edge už nainstalovaná, nebude mít tato zásada žádný vliv.

  Pokud tuto zásadu nenakonfigurujete u určitého kanálu, bude vytvoření zástupce při instalaci aplikace Microsoft Edge určovat zásada Zabránit vytváření zástupců na ploše při výchozí instalaci.</string>
      <string id="TargetChannel_Extended_Stable_DropDown">Extended Stable</string>
      <string id="Pol_AllowSideBySideExperience">Povolit používání různých verzí prohlížeče Microsoft Edge vedle sebe</string>
      <string id="Explain_AutoUpdateCheckPeriod">Minimální počet minut mezi automatickými kontrolami aktualizací.

Když tuto zásadu nastavíte na 0, zakážete všechny pravidelné síťové přenosy služby Microsoft Edge Update. Tuto možnost nedoporučujeme, protože službě Microsoft Edge Update zabraňuje v získávání aktualizací stability a zabezpečení.

Za účelem správy aktualizací aplikací by se místo tohoto nastavení měla používat nastavení „Výchozí nastavení pro přepis zásad pro aktualizace“ a „Přepis zásad pro aktualizace“ u jednotlivých aplikací.</string>
      <string id="Sup_EdgeUpdate1_3_119_43">Aktualizace Microsoft Edge 1.3.119.43 and novější</string>
      <string id="Explain_DefaultUpdatePolicy">Umožňuje určit výchozí chování všech kanálů týkající se způsobu, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge. Může být přepsáno u jednotlivých kanálů určením zásady Přepis zásad pro aktualizace pro tyto konkrétní kanály.

  Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
   – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
   – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
   – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel.
   – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

  Pokud vyberete ruční aktualizace, nezapomeňte aktualizace pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

  Pokud nastavení této zásady nepovolíte a nenakonfigurujete, Microsoft Edge Update zpracovává dostupné aktualizace podle zásady Přepis zásad pro aktualizace.

  Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_WebView_AutoUpdate">Umožňuje vám určit, jestli se povolí automatické aktualizace pro modul runtime WebView2. Modul runtime WebView2 je komponenta, kterou aplikace používají k pro zobrazování obsahu na webu.
  Automatické aktualizace jsou ve výchozím nastavení povolené. Zakázání automatických aktualizací modulu rutime WebView2 může způsobit problémy s kompatibilitou u aplikací, které jsou na komponentě závislé.

  Pokud toto zásadu povolíte, provede Microsoft Edge Update aktualizace modulu runtime WebView2 podle toho, jak nakonfigurujete následující možnosti:
  – Vždy povolit aktualizace: Aktualizace se automaticky stáhnou a použijí
  – Zakázané aktualizace: Aktualizace se nikdy nestáhnou ani nepoužijí

  Pokud tuto zásadu nepovolíte, aktualizace se automaticky stáhnou a použijí.</string>
      <string id="Sup_GoogleUpdate1_3_34_3">Microsoft Edge Update 1.3.34.3 a novější</string>
      <string id="ProxyAutoDetect_DropDown">Automaticky zjišťovat nastavení proxy serveru</string>
      <string id="ProxyPacScript_DropDown">Používat skript .pac proxy serveru</string>
      <string id="DownloadPreference_DropDown">Adresy URL pro stahování do mezipaměti</string>
      <string id="Name_ForceInstallsUser">Vynutit instalace (na uživatele)</string>
      <string id="Explain_AllowSideBySideExperience">Tato zásada uživateli umožňuje používat vedle sebe Microsoft Edge (Edge HTML) a Microsoft Edge (založený na projektu Chromium).

Pokud je tato zásada nastavená na Nenakonfigurováno, pak Microsoft Edge (založený na projektu Chromium) potom, co proběhne jeho instalace z kanálu Stable a instalace aktualizací zabezpečení z listopadu 2019, nahradí Microsoft Edge (Edge HTML). Jedná se o stejné chování jako v případě nastavení Zakázáno.

Nastavení Zakázáno znemožní používání zmíněných verzí vedle sebe a Microsoft Edge (založený na projektu Chromium) poté, co proběhne jeho instalace z kanálu Stable a instalace aktualizací zabezpečení z listopadu 2019, nahradí Microsoft Edge (Edge HTML). Jedná se o stejné chování jako v případě nastavení Nenakonfigurováno.

Pokud je tato zásada povolená, Microsoft Edge (založený na projektu Chromium) a Microsoft Edge (Edge HTML) můžou po instalaci Microsoft Edge (založeného na projektu Chromium) fungovat vedle sebe.

Tato zásada skupiny bude účinná jen v případě, že k její konfiguraci dojde před automatickou instalací Microsoft Edge (založeného na projektu Chromium), kterou provádí služba Windows Update. Poznámka: ​Uživatel může automatickou aktualizaci Microsoft Edge (založeného na projektu Chromium) zablokovat pomocí sady nástrojů určené k tomuto účelu.

Od Windows 10 verze 20H2 se starší verze Microsoft Edge a používání prohlížečů vedle sebe nepodporují.</string>
      <string id="Explain_RemoveDesktopShortcut">Pokud tuto zásadu nastavíte na možnost Vynutit odstranění zástupců na ploše na úrovni systému, budou při aktualizaci prohlížeče nebo restartování počítače odstraněni stávající zástupci na úrovni systému Microsoft Edge na ploše.
 Pokud tuto zásadu nastavíte na možnost Vynutit odstranění zástupců na ploše na úrovni systému a na úrovni uživatele, budou při aktualizaci prohlížeče nebo restartování počítače odstraněni stávající zástupci na úrovni systému Microsoft Edge na ploše a při aktualizaci prohlížeče budou odstraněni stávající zástupci na ploše na úrovni uživatele. To zahrnuje zástupce na ploše na úrovni uživatele, které si uživatelé mohli sami nastavit.
 Pokud tuto zásadu nenakonfigurujete, stávajícím zástupcům Microsoft Edge na ploše se nic nestane.

 Pokud tuto zásadu pro kanál nenakonfigurujete, konfigurace zásad Při aktualizaci výchozího nastavení odebrat zástupce na ploše určí, zda se má zástupce na ploše odebrat.</string>
      <string id="ProxyDisabled_DropDown">Nikdy nepoužívat proxy server</string>
      <string id="Pol_DefaultAllowInstallation">Výchozí nastavení pro povolení instalace</string>
      <string id="Pol_ProxyPacUrl">Adresa URL souboru .pac proxy serveru</string>
      <string id="Cat_Applications">Aplikace</string>
      <string id="Explain_ProxyPacUrl">Umožňuje určit adresu URL souboru automatické konfigurace proxy serveru (PAC).

Pokud tuto zásadu povolíte, můžete určit adresu URL souboru PAC k automatizaci způsobu, jakým Microsoft Edge Update vybírá odpovídající proxy server pro načtení konkrétního webu.

  Tato zásada se použije jen v případě, že jste v zásadě Zvolte způsob zadání nastavení proxy serveru. zadali ruční nastavení proxy serveru.

  Tuto zásadu nekonfigurujte, pokud jste v zásadě Zvolte způsob zadání nastavení proxy serveru. vybrali jiné nastavení proxy serveru než ruční.</string>
      <string id="Sup_EdgeUpdate1_3_145_1">Microsoft Edge Update 1.3.145.1 a novější</string>
      <string id="TargetChannel_Beta_DropDown">Beta</string>
      <string id="Sup_EdgeUpdate1_3_168_21">Microsoft Edge Update 1.3.168.21 a novější</string>
      <string id="Explain_Preferences">Obecné zásady pro Microsoft Edge Update</string>
      <string id="Explain_WebView">Určuje zásady pro modul runtime WebView2.</string>
      <string id="Explain_ProxyServer">Umožňuje určit adresu URL proxy serveru pro Microsoft Edge Update, která se má používat.

  Pokud tuto zásadu povolíte, budete moct nastavit adresu URL proxy serveru, která se bude používat pro Microsoft Edge Update ve vaší organizaci.

  Tato zásada se použije jen v případě, že jste v zásadě Zvolte způsob zadání nastavení proxy serveru. vybrali ruční nastavení proxy serveru.

  Tuto zásadu nekonfigurujte, pokud jste v zásadě Zvolte způsob zadání nastavení proxy serveru. vybrali jiné nastavení proxy serveru než ruční.</string>
      <string id="Explain_DefaultAllowInstallation">Můžete určit výchozí chování pro všechny kanály týkající se povolení nebo blokování Microsoft Edge na zařízeních připojených k doméně.

U jednotlivých kanálů je možné toto nastavení přepsat povolením zásady Povolit instalaci.

Pokud tuto zásadu zakážete, instalace Microsoft Edge se zablokuje. Na instalaci softwaru Microsoft Edge to má vliv jen v případě, že není nakonfigurovaná zásada Povolit instalaci.

Tato zásada neznemožňuje spuštění služby Microsoft Edge Update ani uživatelům nebrání v instalaci softwaru Microsoft Edge jinými způsoby.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Sup_EdgeUpdate1_3_155_1">Microsoft Edge Update 1.3.155.1 a novější</string>
      <string id="TargetChannel_Stable_DropDown">Stabilní</string>
      <string id="Cat_Google">Microsoft</string>
      <string id="Pol_DefaultUpdatePolicy">Výchozí nastavení pro přepis zásad pro aktualizace</string>
      <string id="Explain_ProxyMode">Umožňuje určit nastavení proxy serveru, která bude používat Microsoft Edge Update.

  Pokud tuto zásadu povolíte, můžete si vybrat z následujících možností proxy serveru:
   – Pokud se rozhodnete nikdy nepoužívat proxy server a vždy se připojovat přímo, budou všechny ostatní možnosti ignorovány.
   – Pokud se rozhodnete používat systémové nastavení proxy serveru nebo automaticky zjišťovat proxy server, budou všechny ostatní možnosti ignorovány.
   – Pokud zvolíte režim pevného proxy serveru, můžete určit další možnosti v zásadě Adresa nebo adresa URL proxy serveru.
   – Pokud se rozhodnete používat skript .pac proxy serveru, musíte určit adresu URL tohoto skriptu v zásadě Adresa URL do proxy souboru PAC.

  Pokud tuto zásadu povolíte, nebudou uživatelé ve vaší organizaci moct měnit nastavení proxy serveru ve službě Microsoft Edge Update.

  Pokud tuto zásadu zakážete nebo nenakonfigurujete, nebudou nakonfigurována žádná nastavení proxy serveru, ale uživatelé ve vaší organizaci si budou moct zvolit vlastní nastavení proxy serveru pro Microsoft Edge Update.</string>
      <string id="Sup_GoogleUpdate1_3_26_0">Microsoft Edge Update 1.3.26.0 a novější</string>
      <string id="Pol_RemoveDesktopShortcut">Při aktualizaci odebrat zástupce na ploše</string>
      <string id="Sup_EdgeUpdate1_3_147_1">Microsoft Edge Update 1.3.147.1 a novější</string>
      <string id="Name_UpdatesDisabled">Aktualizace zakázány</string>
      <string id="Pol_RollbackToTargetVersion">Vrátit na určitou cílovou verzi</string>
      <string id="Explain_WebView_Install">Umožňuje vám určit, jestli se modul Runtime WebView2 dá nainstalovat pomocí služby Microsoft Edge Update.

  Pokud tuto zásadu povolíte, mohou uživatelé nainstalovat modul Runtime WebView2 prostřednictvím Microsoft Edge Update.

  Pokud tuto zásadu zakážete (nebo ji nastavíte na Zakázáno instalace), uživatelé nemůžou nainstalovat modul Runtime WebView2 prostřednictvím Microsoft Edge Update.

  Pokud tuto zásadu nastavíte na možnost Vždy povolit instalace pro celý počítač, ale ne instalace pro jednotlivé uživatele, modul runtime WebView2 bude nasazen pouze pro celý počítač.

  Pokud zásadu nastavíte na Vynucené instalace (pro celý počítač), můžou uživatelé nainstalovat modul Runtime WebView2 na všechny počítače, na kterých je předinstalovaná služba Microsoft Edge Update. Vyžaduje Microsoft Edge Update 1.3.155.43 nebo vyšší.

  Pokud tuto zásadu nenakonfigurujete, modul runtime WebView2 se nainstaluje prostřednictvím Microsoft Edge Update.</string>
      <string id="Explain_GoogleUpdate">Zásady pro řízení instalace a aktualizace Microsoft Edge přes Microsoft Edge Update</string>
      <string id="Explain_DefaultRemoveDesktopShortcut">Umožňuje určit výchozí chování pro všechny kanály pro vytvoření zástupce na ploše při instalaci Microsoft Edge.

 Pokud tuto zásadu nastavíte na možnost Vynutit odstranění zástupců na ploše na úrovni systému, budou při aktualizaci prohlížeče nebo restartování počítače odstraněni stávající zástupci na úrovni systému Microsoft Edge na ploše.
  Pokud tuto zásadu nastavíte na možnost Vynutit odstranění zástupců na ploše na úrovni systému a na úrovni uživatele, budou při aktualizaci prohlížeče nebo restartování počítače odstraněni stávající zástupci na úrovni systému Microsoft Edge na ploše a při aktualizaci prohlížeče budou odstraněni stávající zástupci na ploše na úrovni uživatele. To zahrnuje zástupce na ploše na úrovni uživatele, které si uživatelé mohli sami nastavit.
 Pokud tuto zásadu nenakonfigurujete, stávajícím zástupcům Microsoft Edge na ploše se nic nestane.</string>
      <string id="Explain_UpdateCheckSuppressedPeriod">Pokud tuto zásadu povolíte, vyhledávání aktualizací se každý den potlačí od času hodina:minuta na určitou dobu (v minutách). Tato doba nezohledňuje změny související s letním časem. Pokud je například počáteční čas nastavený na 22:00 a doba je nastavená na 480 minut, vyhledávání aktualizací se potlačí na přesně 8 hodin, a to bez ohledu na to, jestli během tohoto období začíná nebo končí letní čas.

  Pokud tuto zásadu zakážete nebo nenakonfigurujete, vyhledávání aktualizací se nepotlačí během žádného konkrétního období.</string>
      <string id="Name_UpdatesEnabled">Vždy povolit aktualizace (doporučeno)</string>
      <string id="Cat_ProxyServer">Proxy server</string>
      <string id="Pol_CreateDesktopShortcut">Zabránit vytváření zástupců na ploše při instalaci</string>
      <string id="Pol_AutoUpdateCheckPeriod">Přepis období pro automatické vyhledávání aktualizací</string>
      <string id="Sup_GoogleUpdate1_2_145_5">Microsoft Edge Update 1.2.145.5 a novější</string>
      <string id="Pol_DefaultCreateDesktopShortcut">Zabránit vytváření zástupců na ploše při výchozí instalaci</string>
      <string id="Name_DeleteSystemDesktopShortcuts">Vynutit odstranění zástupců na ploše na úrovni systému</string>
      <string id="Name_ECSCommunicationDisabled">Zakázat komunikaci se Službou experimentálních funkcí a konfigurace</string>
      <string id="Sup_GoogleUpdate1_3_33_5">Microsoft Edge Update 1.3.33.5 a novější</string>
      <string id="Sup_EdgeUpdate1_3_127_1">Aktualizace Microsoft Edge 1.3.127.1 a novější</string>
      <string id="Name_InstallsEnabled">Vždy povolit instalace (doporučeno)</string>
      <string id="Explain_DownloadPreference">Pokud je toto nastavení povolené, pokusí se server Microsoft Edge Update ve svých odpovědích poskytovat pro datové části aktualizací adresy URL, které jsou vhodné pro mezipaměť.</string>
      <string id="Name_AutomaticUpdatesOnly">Jen bezobslužné automatické aktualizace</string>
      <string id="Pol_TargetVersionPrefix">Přepsání cílové verze</string>
      <string id="Pol_DownloadPreference">Přepis třídy adresy URL pro stahování</string>
      <string id="Pol_UpdateCheckSuppressedPeriod">Časové období během každého dne, kdy se má potlačit automatické vyhledávání aktualizací</string>
      <string id="Sup_EdgeUpdate1_3_128_0">Aktualizace Microsoft Edge 1.3.128.0 a novější</string>
      <string id="Cat_WebView">Microsoft Edge WebView2 Runtime</string>
      <string id="Pol_UpdatePolicy">Přepis zásad pro aktualizace</string>
      <string id="Pol_ProxyServer">Adresa nebo URL proxy serveru</string>
      <string id="Explain_DefaultCreateDesktopShortcut">Umožňuje určit výchozí chování pro všechny kanály pro vytvoření zástupce na ploše při instalaci Microsoft Edge.

 Pokud tuto zásadu povolíte, při instalaci Microsoft Edge se vytvoří zástupce na ploše.
 Pokud tuto zásadu zakážete, při instalaci Microsoft Edge se nevytvoří žádný zástupce na ploše.
 Pokud tuto zásadu nenakonfigurujete, při instalaci se vytvoří zástupce na Microsoft Edge.
 Pokud je Microsoft Edge už nainstalovaný, nebude mít tato zásada žádný efekt.</string>
      <string id="Name_DeleteAllDesktopShortcuts">Vynutit odstranění zástupců na ploše na úrovni systému a na úrovni uživatele</string>
      <string id="ProxyUseSystem_DropDown">Použít pevné nastavení proxy serveru</string>
      <string id="Cat_Preferences">Předvolby</string>
      <string id="Name_InstallsEnabledMachineOnly">Vždy povolit Machine-Wide instalace, ale ne Per-User instalace</string>
      <string id="Cat_GoogleUpdate">Microsoft Edge Update</string>
      <string id="Cat_MicrosoftEdge">Microsoft Edge</string>
      <string id="Explain_InstallMicrosoftEdge">Určuje, jestli je možné na zařízení připojená k doméně nainstalovat určitý kanál Microsoft Edge.

 Pokud tuto zásadu pro určitý kanál povolíte, instalace Microsoft Edge se nezablokuje.

 Pokud tuto zásadu pro určitý kanál zakážete (nebo ji nastavíte na Instalace zakázány), instalace Microsoft Edge se zablokuje.

 Pokud tuto zásadu pro určitý kanál nenakonfigurujete, pak o tom, jestli si můžou uživatelé daný kanál Microsoft Edge nainstalovat, rozhoduje konfigurace zásady Výchozí nastavení pro povolení instalace.

Pokud tuto zásadu nastavíte na Vždy povolit instalace pro celý počítač, ale ne pro jednotlivé uživatele, nasadí se APP_NAME jenom pro celý počítač.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (pro celý počítač), bude APP_NAME možné nasadit pouze pro celý počítač a v případě, že je předinstalovaná Microsoft Edge Update. Vyžaduje se Microsoft Edge Update 1.3.155.43 nebo vyšší.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (na uživatele), může být APP_NAME nasazena do všech počítačů pouze pro jednotlivé uživatele, pokud je Microsoft Edge Update předem nainstalovaná pro jednotlivé uživatele. Vyžaduje Microsoft Edge Update 1.3.155.43 nebo vyšší.

Tato zásada je dostupná jenom v instancích Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdge">Určuje, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge.

Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
  – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
  – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
  – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel. (Rozhraní pro tuto možnost neposkytují všechny aplikace.)
  – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

Pokud vyberete ruční aktualizace, nezapomeňte je pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

Pokud tuto zásadu nepovolíte a nenakonfigurujete, Microsoft Edge Update bude zpracovávat dostupné aktualizace podle zásady Výchozí nastavení pro přepis zásad pro aktualizace.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2136406.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdge">Určuje, na který kanál se má Microsoft Edge aktualizovat.

Pokud tuto funkci povolíte, Microsoft Edge se bude aktualizovat na daný kanál podle toho, jak nakonfigurujete následující možnosti:

  – Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Stable.
  – Beta: Microsoft Edge se bude aktualizovat na nejnovější verzi Beta.
  – Dev: Microsoft Edge se bude aktualizovat na nejnovější verzi Dev.
  – Extended Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Extended Stable, která má delší odstupy mezi vydáními než verze Stable. Další informace najdete na adrese https://go.microsoft.com/fwlink/?linkid=2163508.

Pokud tuto zásadu nenakonfigurujete, Microsoft Edge se bude aktualizovat na nejnovější verzi dostupnou pro výchozí kanál.

Tyto zásady jsou k dispozici pouze u instancí Windows, které jsou připojeny k doméně služby Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdge">Když je tato zásada povolená a automatické aktualizace také, Microsoft Edge se aktualizuje na verzi určenou hodnotou této zásady.

Hodnota zásady musí odpovídat konkrétní verzi prohlížeče Edge, např. 83.0.499.12.

Pokud je na zařízení už nainstalovaná vyšší verze, zůstane Microsoft Edge ve vyšší verzi a nepřeinstaluje se na starší verzi určenou hodnotou zásady.

Pokud konkrétní verze neexistuje, nebo je ve špatném formátu, Edge zůstane ve své současné verzi a nebude se automaticky aktualizovat na novější verze.

Další informace najdete na https://go.microsoft.com/fwlink/?linkid=2136707.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdge">Určuje, jestli má Microsoft Edge Update vrátit instalace Microsoft Edge na verzi uvedenou v zásadě Přepsání cílové verze.

Tato zásada je neúčinná, pokud není nastavená zásada Přepsání cílové verze a pokud zásada Přepis zásad pro aktualizace nemá jeden ze stavů ZAPNUTO (Vždy povolit aktualizace, Jen bezobslužné automatické aktualizace, Jen ruční aktualizace).

Pokud tuto zásadu zakážete nebo nenakonfigurujete, instalace, které mají vyšší verzi, než určuje zásada Přepsání cílové verze, zůstanou beze změny.

Pokud tuto zásadu povolíte, instalace s aktuální verzí vyšší, než určuje zásada Přepsání cílové verze, se downgradují na cílovou verzi.

Doporučujeme, aby si uživatelé nainstalovali nejnovější verzi prohlížeče Microsoft Edge, aby byli chráněni prostřednictvím nejnovějších aktualizací zabezpečení. Návrat ke starším verzím s sebou nese riziko, že budou vystaveni známým problémům se zabezpečením. Účelem této zásady je fungovat jako dočasné řešení potíží s aktualizací Microsoft Edge.

Než se dočasně vrátíte k předchozí verzi prohlížeče, doporučujeme zapnout synchronizaci (https://go.microsoft.com/fwlink/?linkid=2133032), a to pro všechny uživatele ve vaší organizaci. Pokud synchronizaci nezapnete, vzniká riziko trvalé ztráty údajů o procházení. Tuto zásadu používáte na vlastní nebezpečí.

Poznámka: Všechny verze, které umožňují návrat, najdete na stránce https://aka.ms/EdgeEnterprise.

Tato zásada se vztahuje na Microsoft Edge verze 86 nebo novější.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2133918.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdge">Umožňuje určit, jestli se uživatelé v Programu Windows Insider zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu povolíte, uživatelé v Program Windows Insider se zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu zakážete, uživatelé v Program Windows Insider se nebudou moct prostřednictvím Microsoft Edge Update zaregistrovat do Edge Preview.

   – Pokud tuto zásadu nenakonfigurujete, uživatelé v Program Windows Insider se ve výchozím nastavení zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.</string>
      <string id="Cat_MicrosoftEdgeBeta">Microsoft Edge Beta</string>
      <string id="Explain_InstallMicrosoftEdgeBeta">Určuje, jestli je možné na zařízení připojená k doméně nainstalovat určitý kanál Microsoft Edge.

 Pokud tuto zásadu pro určitý kanál povolíte, instalace Microsoft Edge se nezablokuje.

 Pokud tuto zásadu pro určitý kanál zakážete (nebo ji nastavíte na Instalace zakázány), instalace Microsoft Edge se zablokuje.

 Pokud tuto zásadu pro určitý kanál nenakonfigurujete, pak o tom, jestli si můžou uživatelé daný kanál Microsoft Edge nainstalovat, rozhoduje konfigurace zásady Výchozí nastavení pro povolení instalace.

Pokud tuto zásadu nastavíte na Vždy povolit instalace pro celý počítač, ale ne pro jednotlivé uživatele, nasadí se APP_NAME jenom pro celý počítač.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (pro celý počítač), bude APP_NAME možné nasadit pouze pro celý počítač a v případě, že je předinstalovaná Microsoft Edge Update. Vyžaduje se Microsoft Edge Update 1.3.155.43 nebo vyšší.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (na uživatele), může být APP_NAME nasazena do všech počítačů pouze pro jednotlivé uživatele, pokud je Microsoft Edge Update předem nainstalovaná pro jednotlivé uživatele. Vyžaduje Microsoft Edge Update 1.3.155.43 nebo vyšší.

Tato zásada je dostupná jenom v instancích Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeBeta">Určuje, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge.

Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
  – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
  – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
  – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel. (Rozhraní pro tuto možnost neposkytují všechny aplikace.)
  – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

Pokud vyberete ruční aktualizace, nezapomeňte je pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

Pokud tuto zásadu nepovolíte a nenakonfigurujete, Microsoft Edge Update bude zpracovávat dostupné aktualizace podle zásady Výchozí nastavení pro přepis zásad pro aktualizace.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2136406.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeBeta">Určuje, na který kanál se má Microsoft Edge aktualizovat.

Pokud tuto funkci povolíte, Microsoft Edge se bude aktualizovat na daný kanál podle toho, jak nakonfigurujete následující možnosti:

  – Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Stable.
  – Beta: Microsoft Edge se bude aktualizovat na nejnovější verzi Beta.
  – Dev: Microsoft Edge se bude aktualizovat na nejnovější verzi Dev.
  – Extended Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Extended Stable, která má delší odstupy mezi vydáními než verze Stable. Další informace najdete na adrese https://go.microsoft.com/fwlink/?linkid=2163508.

Pokud tuto zásadu nenakonfigurujete, Microsoft Edge se bude aktualizovat na nejnovější verzi dostupnou pro výchozí kanál.

Tyto zásady jsou k dispozici pouze u instancí Windows, které jsou připojeny k doméně služby Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeBeta">Když je tato zásada povolená a automatické aktualizace také, Microsoft Edge se aktualizuje na verzi určenou hodnotou této zásady.

Hodnota zásady musí odpovídat konkrétní verzi prohlížeče Edge, např. 83.0.499.12.

Pokud je na zařízení už nainstalovaná vyšší verze, zůstane Microsoft Edge ve vyšší verzi a nepřeinstaluje se na starší verzi určenou hodnotou zásady.

Pokud konkrétní verze neexistuje, nebo je ve špatném formátu, Edge zůstane ve své současné verzi a nebude se automaticky aktualizovat na novější verze.

Další informace najdete na https://go.microsoft.com/fwlink/?linkid=2136707.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeBeta">Určuje, jestli má Microsoft Edge Update vrátit instalace Microsoft Edge na verzi uvedenou v zásadě Přepsání cílové verze.

Tato zásada je neúčinná, pokud není nastavená zásada Přepsání cílové verze a pokud zásada Přepis zásad pro aktualizace nemá jeden ze stavů ZAPNUTO (Vždy povolit aktualizace, Jen bezobslužné automatické aktualizace, Jen ruční aktualizace).

Pokud tuto zásadu zakážete nebo nenakonfigurujete, instalace, které mají vyšší verzi, než určuje zásada Přepsání cílové verze, zůstanou beze změny.

Pokud tuto zásadu povolíte, instalace s aktuální verzí vyšší, než určuje zásada Přepsání cílové verze, se downgradují na cílovou verzi.

Doporučujeme, aby si uživatelé nainstalovali nejnovější verzi prohlížeče Microsoft Edge, aby byli chráněni prostřednictvím nejnovějších aktualizací zabezpečení. Návrat ke starším verzím s sebou nese riziko, že budou vystaveni známým problémům se zabezpečením. Účelem této zásady je fungovat jako dočasné řešení potíží s aktualizací Microsoft Edge.

Než se dočasně vrátíte k předchozí verzi prohlížeče, doporučujeme zapnout synchronizaci (https://go.microsoft.com/fwlink/?linkid=2133032), a to pro všechny uživatele ve vaší organizaci. Pokud synchronizaci nezapnete, vzniká riziko trvalé ztráty údajů o procházení. Tuto zásadu používáte na vlastní nebezpečí.

Poznámka: Všechny verze, které umožňují návrat, najdete na stránce https://aka.ms/EdgeEnterprise.

Tato zásada se vztahuje na Microsoft Edge verze 86 nebo novější.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2133918.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeBeta">Umožňuje určit, jestli se uživatelé v Programu Windows Insider zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu povolíte, uživatelé v Program Windows Insider se zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu zakážete, uživatelé v Program Windows Insider se nebudou moct prostřednictvím Microsoft Edge Update zaregistrovat do Edge Preview.

   – Pokud tuto zásadu nenakonfigurujete, uživatelé v Program Windows Insider se ve výchozím nastavení zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.</string>
      <string id="Cat_MicrosoftEdgeDev">Microsoft Edge Dev</string>
      <string id="Explain_InstallMicrosoftEdgeDev">Určuje, jestli je možné na zařízení připojená k doméně nainstalovat určitý kanál Microsoft Edge.

 Pokud tuto zásadu pro určitý kanál povolíte, instalace Microsoft Edge se nezablokuje.

 Pokud tuto zásadu pro určitý kanál zakážete (nebo ji nastavíte na Instalace zakázány), instalace Microsoft Edge se zablokuje.

 Pokud tuto zásadu pro určitý kanál nenakonfigurujete, pak o tom, jestli si můžou uživatelé daný kanál Microsoft Edge nainstalovat, rozhoduje konfigurace zásady Výchozí nastavení pro povolení instalace.

Pokud tuto zásadu nastavíte na Vždy povolit instalace pro celý počítač, ale ne pro jednotlivé uživatele, nasadí se APP_NAME jenom pro celý počítač.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (pro celý počítač), bude APP_NAME možné nasadit pouze pro celý počítač a v případě, že je předinstalovaná Microsoft Edge Update. Vyžaduje se Microsoft Edge Update 1.3.155.43 nebo vyšší.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (na uživatele), může být APP_NAME nasazena do všech počítačů pouze pro jednotlivé uživatele, pokud je Microsoft Edge Update předem nainstalovaná pro jednotlivé uživatele. Vyžaduje Microsoft Edge Update 1.3.155.43 nebo vyšší.

Tato zásada je dostupná jenom v instancích Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeDev">Určuje, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge.

Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
  – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
  – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
  – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel. (Rozhraní pro tuto možnost neposkytují všechny aplikace.)
  – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

Pokud vyberete ruční aktualizace, nezapomeňte je pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

Pokud tuto zásadu nepovolíte a nenakonfigurujete, Microsoft Edge Update bude zpracovávat dostupné aktualizace podle zásady Výchozí nastavení pro přepis zásad pro aktualizace.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2136406.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeDev">Určuje, na který kanál se má Microsoft Edge aktualizovat.

Pokud tuto funkci povolíte, Microsoft Edge se bude aktualizovat na daný kanál podle toho, jak nakonfigurujete následující možnosti:

  – Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Stable.
  – Beta: Microsoft Edge se bude aktualizovat na nejnovější verzi Beta.
  – Dev: Microsoft Edge se bude aktualizovat na nejnovější verzi Dev.
  – Extended Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Extended Stable, která má delší odstupy mezi vydáními než verze Stable. Další informace najdete na adrese https://go.microsoft.com/fwlink/?linkid=2163508.

Pokud tuto zásadu nenakonfigurujete, Microsoft Edge se bude aktualizovat na nejnovější verzi dostupnou pro výchozí kanál.

Tyto zásady jsou k dispozici pouze u instancí Windows, které jsou připojeny k doméně služby Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeDev">Když je tato zásada povolená a automatické aktualizace také, Microsoft Edge se aktualizuje na verzi určenou hodnotou této zásady.

Hodnota zásady musí odpovídat konkrétní verzi prohlížeče Edge, např. 83.0.499.12.

Pokud je na zařízení už nainstalovaná vyšší verze, zůstane Microsoft Edge ve vyšší verzi a nepřeinstaluje se na starší verzi určenou hodnotou zásady.

Pokud konkrétní verze neexistuje, nebo je ve špatném formátu, Edge zůstane ve své současné verzi a nebude se automaticky aktualizovat na novější verze.

Další informace najdete na https://go.microsoft.com/fwlink/?linkid=2136707.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeDev">Určuje, jestli má Microsoft Edge Update vrátit instalace Microsoft Edge na verzi uvedenou v zásadě Přepsání cílové verze.

Tato zásada je neúčinná, pokud není nastavená zásada Přepsání cílové verze a pokud zásada Přepis zásad pro aktualizace nemá jeden ze stavů ZAPNUTO (Vždy povolit aktualizace, Jen bezobslužné automatické aktualizace, Jen ruční aktualizace).

Pokud tuto zásadu zakážete nebo nenakonfigurujete, instalace, které mají vyšší verzi, než určuje zásada Přepsání cílové verze, zůstanou beze změny.

Pokud tuto zásadu povolíte, instalace s aktuální verzí vyšší, než určuje zásada Přepsání cílové verze, se downgradují na cílovou verzi.

Doporučujeme, aby si uživatelé nainstalovali nejnovější verzi prohlížeče Microsoft Edge, aby byli chráněni prostřednictvím nejnovějších aktualizací zabezpečení. Návrat ke starším verzím s sebou nese riziko, že budou vystaveni známým problémům se zabezpečením. Účelem této zásady je fungovat jako dočasné řešení potíží s aktualizací Microsoft Edge.

Než se dočasně vrátíte k předchozí verzi prohlížeče, doporučujeme zapnout synchronizaci (https://go.microsoft.com/fwlink/?linkid=2133032), a to pro všechny uživatele ve vaší organizaci. Pokud synchronizaci nezapnete, vzniká riziko trvalé ztráty údajů o procházení. Tuto zásadu používáte na vlastní nebezpečí.

Poznámka: Všechny verze, které umožňují návrat, najdete na stránce https://aka.ms/EdgeEnterprise.

Tato zásada se vztahuje na Microsoft Edge verze 86 nebo novější.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2133918.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeDev">Umožňuje určit, jestli se uživatelé v Programu Windows Insider zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu povolíte, uživatelé v Program Windows Insider se zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu zakážete, uživatelé v Program Windows Insider se nebudou moct prostřednictvím Microsoft Edge Update zaregistrovat do Edge Preview.

   – Pokud tuto zásadu nenakonfigurujete, uživatelé v Program Windows Insider se ve výchozím nastavení zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.</string>
      <string id="Cat_MicrosoftEdgeCanary">Microsoft Edge Canary</string>
      <string id="Explain_InstallMicrosoftEdgeCanary">Určuje, jestli je možné na zařízení připojená k doméně nainstalovat určitý kanál Microsoft Edge.

 Pokud tuto zásadu pro určitý kanál povolíte, instalace Microsoft Edge se nezablokuje.

 Pokud tuto zásadu pro určitý kanál zakážete (nebo ji nastavíte na Instalace zakázány), instalace Microsoft Edge se zablokuje.

 Pokud tuto zásadu pro určitý kanál nenakonfigurujete, pak o tom, jestli si můžou uživatelé daný kanál Microsoft Edge nainstalovat, rozhoduje konfigurace zásady Výchozí nastavení pro povolení instalace.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (na uživatele), může být APP_NAME nasazena do všech počítačů pouze pro jednotlivé uživatele, pokud je Microsoft Edge Update předem nainstalovaná pro jednotlivé uživatele. Vyžaduje Microsoft Edge Update 1.3.155.43 nebo vyšší.

Tato zásada je dostupná jenom v instancích Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeCanary">Určuje, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge.

Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
  – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
  – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
  – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel. (Rozhraní pro tuto možnost neposkytují všechny aplikace.)
  – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

Pokud vyberete ruční aktualizace, nezapomeňte je pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

Pokud tuto zásadu nepovolíte a nenakonfigurujete, Microsoft Edge Update bude zpracovávat dostupné aktualizace podle zásady Výchozí nastavení pro přepis zásad pro aktualizace.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2136406.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeCanary">Určuje, na který kanál se má Microsoft Edge aktualizovat.

Pokud tuto funkci povolíte, Microsoft Edge se bude aktualizovat na daný kanál podle toho, jak nakonfigurujete následující možnosti:

  – Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Stable.
  – Beta: Microsoft Edge se bude aktualizovat na nejnovější verzi Beta.
  – Dev: Microsoft Edge se bude aktualizovat na nejnovější verzi Dev.
  – Extended Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Extended Stable, která má delší odstupy mezi vydáními než verze Stable. Další informace najdete na adrese https://go.microsoft.com/fwlink/?linkid=2163508.

Pokud tuto zásadu nenakonfigurujete, Microsoft Edge se bude aktualizovat na nejnovější verzi dostupnou pro výchozí kanál.

Tyto zásady jsou k dispozici pouze u instancí Windows, které jsou připojeny k doméně služby Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeCanary">Když je tato zásada povolená a automatické aktualizace také, Microsoft Edge se aktualizuje na verzi určenou hodnotou této zásady.

Hodnota zásady musí odpovídat konkrétní verzi prohlížeče Edge, např. 83.0.499.12.

Pokud je na zařízení už nainstalovaná vyšší verze, zůstane Microsoft Edge ve vyšší verzi a nepřeinstaluje se na starší verzi určenou hodnotou zásady.

Pokud konkrétní verze neexistuje, nebo je ve špatném formátu, Edge zůstane ve své současné verzi a nebude se automaticky aktualizovat na novější verze.

Další informace najdete na https://go.microsoft.com/fwlink/?linkid=2136707.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeCanary">Určuje, jestli má Microsoft Edge Update vrátit instalace Microsoft Edge na verzi uvedenou v zásadě Přepsání cílové verze.

Tato zásada je neúčinná, pokud není nastavená zásada Přepsání cílové verze a pokud zásada Přepis zásad pro aktualizace nemá jeden ze stavů ZAPNUTO (Vždy povolit aktualizace, Jen bezobslužné automatické aktualizace, Jen ruční aktualizace).

Pokud tuto zásadu zakážete nebo nenakonfigurujete, instalace, které mají vyšší verzi, než určuje zásada Přepsání cílové verze, zůstanou beze změny.

Pokud tuto zásadu povolíte, instalace s aktuální verzí vyšší, než určuje zásada Přepsání cílové verze, se downgradují na cílovou verzi.

Doporučujeme, aby si uživatelé nainstalovali nejnovější verzi prohlížeče Microsoft Edge, aby byli chráněni prostřednictvím nejnovějších aktualizací zabezpečení. Návrat ke starším verzím s sebou nese riziko, že budou vystaveni známým problémům se zabezpečením. Účelem této zásady je fungovat jako dočasné řešení potíží s aktualizací Microsoft Edge.

Než se dočasně vrátíte k předchozí verzi prohlížeče, doporučujeme zapnout synchronizaci (https://go.microsoft.com/fwlink/?linkid=2133032), a to pro všechny uživatele ve vaší organizaci. Pokud synchronizaci nezapnete, vzniká riziko trvalé ztráty údajů o procházení. Tuto zásadu používáte na vlastní nebezpečí.

Poznámka: Všechny verze, které umožňují návrat, najdete na stránce https://aka.ms/EdgeEnterprise.

Tato zásada se vztahuje na Microsoft Edge verze 86 nebo novější.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2133918.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeCanary">Umožňuje určit, jestli se uživatelé v Programu Windows Insider zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu povolíte, uživatelé v Program Windows Insider se zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu zakážete, uživatelé v Program Windows Insider se nebudou moct prostřednictvím Microsoft Edge Update zaregistrovat do Edge Preview.

   – Pokud tuto zásadu nenakonfigurujete, uživatelé v Program Windows Insider se ve výchozím nastavení zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.</string>
      <string id="Cat_MicrosoftEdgeWebView">Microsoft Edge WebView</string>
      <string id="Explain_InstallMicrosoftEdgeWebView">Určuje, jestli je možné na zařízení připojená k doméně nainstalovat určitý kanál Microsoft Edge.

 Pokud tuto zásadu pro určitý kanál povolíte, instalace Microsoft Edge se nezablokuje.

 Pokud tuto zásadu pro určitý kanál zakážete (nebo ji nastavíte na Instalace zakázány), instalace Microsoft Edge se zablokuje.

 Pokud tuto zásadu pro určitý kanál nenakonfigurujete, pak o tom, jestli si můžou uživatelé daný kanál Microsoft Edge nainstalovat, rozhoduje konfigurace zásady Výchozí nastavení pro povolení instalace.

Pokud tuto zásadu nastavíte na Vždy povolit instalace pro celý počítač, ale ne pro jednotlivé uživatele, nasadí se APP_NAME jenom pro celý počítač.

Pokud tuto zásadu nastavíte na možnost Vynutit instalace (pro celý počítač), bude APP_NAME možné nasadit pouze pro celý počítač a v případě, že je předinstalovaná Microsoft Edge Update. Vyžaduje se Microsoft Edge Update 1.3.155.43 nebo vyšší.

Tato zásada je dostupná jenom v instancích Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeWebView">Určuje, jak Microsoft Edge Update zpracovává dostupné aktualizace pro Microsoft Edge.

Pokud tuto zásadu povolíte, Microsoft Edge Update bude aktualizace pro Microsoft Edge zpracovávat podle toho, kterou z následujících možností nakonfigurujete:
  – Vždy povolit aktualizace: Zjištěné aktualizace se vždy použijí, ať už k jejich nalezení dojde při pravidelném, nebo ručně spuštěném vyhledávání aktualizací.
  – Jen bezobslužné automatické aktualizace: Aktualizace se použijí jen v případě, že k jejich nalezení dojde při pravidelném vyhledávání aktualizací.
  – Jen ruční aktualizace: Aktualizace se použijí jen v případě, že vyhledávání aktualizací spustil ručně uživatel. (Rozhraní pro tuto možnost neposkytují všechny aplikace.)
  – Aktualizace zakázány: Aktualizace se nepoužijí nikdy.

Pokud vyberete ruční aktualizace, nezapomeňte je pravidelně vyhledávat pomocí příslušného mechanismu v aplikaci, pokud je k dispozici. Pokud aktualizace zakážete, pak je pravidelně vyhledávejte a distribuujte uživatelům.

Pokud tuto zásadu nepovolíte a nenakonfigurujete, Microsoft Edge Update bude zpracovávat dostupné aktualizace podle zásady Výchozí nastavení pro přepis zásad pro aktualizace.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2136406.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeWebView">Určuje, na který kanál se má Microsoft Edge aktualizovat.

Pokud tuto funkci povolíte, Microsoft Edge se bude aktualizovat na daný kanál podle toho, jak nakonfigurujete následující možnosti:

  – Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Stable.
  – Beta: Microsoft Edge se bude aktualizovat na nejnovější verzi Beta.
  – Dev: Microsoft Edge se bude aktualizovat na nejnovější verzi Dev.
  – Extended Stable: Microsoft Edge se bude aktualizovat na nejnovější verzi Extended Stable, která má delší odstupy mezi vydáními než verze Stable. Další informace najdete na adrese https://go.microsoft.com/fwlink/?linkid=2163508.

Pokud tuto zásadu nenakonfigurujete, Microsoft Edge se bude aktualizovat na nejnovější verzi dostupnou pro výchozí kanál.

Tyto zásady jsou k dispozici pouze u instancí Windows, které jsou připojeny k doméně služby Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeWebView">Když je tato zásada povolená a automatické aktualizace také, Microsoft Edge se aktualizuje na verzi určenou hodnotou této zásady.

Hodnota zásady musí odpovídat konkrétní verzi prohlížeče Edge, např. 83.0.499.12.

Pokud je na zařízení už nainstalovaná vyšší verze, zůstane Microsoft Edge ve vyšší verzi a nepřeinstaluje se na starší verzi určenou hodnotou zásady.

Pokud konkrétní verze neexistuje, nebo je ve špatném formátu, Edge zůstane ve své současné verzi a nebude se automaticky aktualizovat na novější verze.

Další informace najdete na https://go.microsoft.com/fwlink/?linkid=2136707.

Tato zásada je dostupná jen u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeWebView">Určuje, jestli má Microsoft Edge Update vrátit instalace Microsoft Edge na verzi uvedenou v zásadě Přepsání cílové verze.

Tato zásada je neúčinná, pokud není nastavená zásada Přepsání cílové verze a pokud zásada Přepis zásad pro aktualizace nemá jeden ze stavů ZAPNUTO (Vždy povolit aktualizace, Jen bezobslužné automatické aktualizace, Jen ruční aktualizace).

Pokud tuto zásadu zakážete nebo nenakonfigurujete, instalace, které mají vyšší verzi, než určuje zásada Přepsání cílové verze, zůstanou beze změny.

Pokud tuto zásadu povolíte, instalace s aktuální verzí vyšší, než určuje zásada Přepsání cílové verze, se downgradují na cílovou verzi.

Doporučujeme, aby si uživatelé nainstalovali nejnovější verzi prohlížeče Microsoft Edge, aby byli chráněni prostřednictvím nejnovějších aktualizací zabezpečení. Návrat ke starším verzím s sebou nese riziko, že budou vystaveni známým problémům se zabezpečením. Účelem této zásady je fungovat jako dočasné řešení potíží s aktualizací Microsoft Edge.

Než se dočasně vrátíte k předchozí verzi prohlížeče, doporučujeme zapnout synchronizaci (https://go.microsoft.com/fwlink/?linkid=2133032), a to pro všechny uživatele ve vaší organizaci. Pokud synchronizaci nezapnete, vzniká riziko trvalé ztráty údajů o procházení. Tuto zásadu používáte na vlastní nebezpečí.

Poznámka: Všechny verze, které umožňují návrat, najdete na stránce https://aka.ms/EdgeEnterprise.

Tato zásada se vztahuje na Microsoft Edge verze 86 nebo novější.

Další informace viz https://go.microsoft.com/fwlink/?linkid=2133918.

Tato zásada je k dispozici pouze u instancí Windows, které jsou připojené k doméně Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeWebView">Umožňuje určit, jestli se uživatelé v Programu Windows Insider zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu povolíte, uživatelé v Program Windows Insider se zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.

   – Pokud tuto zásadu zakážete, uživatelé v Program Windows Insider se nebudou moct prostřednictvím Microsoft Edge Update zaregistrovat do Edge Preview.

   – Pokud tuto zásadu nenakonfigurujete, uživatelé v Program Windows Insider se ve výchozím nastavení zaregistrují do Edge Preview prostřednictvím Microsoft Edge Update.</string>
    </stringTable>
    <presentationTable>
      <presentation id="Pol_AutoUpdateCheckPeriod">
        <decimalTextBox refId="Part_AutoUpdateCheckPeriod" defaultValue="1400"
            spinStep="60">Interval vyhledávání aktualizací v minutách</decimalTextBox>
      </presentation>
      <presentation id="Pol_UpdateCheckSuppressedPeriod">
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartHour"
            defaultValue="0" spinStep="1">Hodina</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartMin"
            defaultValue="0" spinStep="1">Minuta</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedDurationMin"
            defaultValue="60">Trvání</decimalTextBox>
      </presentation>
      <presentation id="Pol_DownloadPreference">
        <dropdownList refId="Part_DownloadPreference"
            defaultItem="0">Typ adresy URL pro stahování k vyžádání</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyMode">
        <dropdownList refId="Part_ProxyMode"
            defaultItem="0">Zvolte způsob zadání nastavení proxy serveru.</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyServer">
        <textBox refId="Part_ProxyServer">
          <label>Adresa nebo adresa URL proxy serveru</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ProxyPacUrl">
        <textBox refId="Part_ProxyPacUrl">
          <label>Adresa URL do proxy souboru PAC</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_DefaultUpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Zásada aktualizace</dropdownList>
      </presentation>
      <presentation id="Pol_UpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Zásada aktualizace</dropdownList>
      </presentation>
      <presentation id="Pol_TargetVersionPrefix">
        <textBox refId="Part_TargetVersionPrefix">
          <label>Cílová verze</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ECSControl">
        <dropdownList refId="Part_ECSControl"
            defaultItem="1">Řízení komunikace aktualizačního nástroje se Službou experimentálních funkcí a konfigurace</dropdownList>
      </presentation>
      <presentation id="Pol_TargetChannel" >
        <dropdownList refId="Part_TargetChannel"
            defaultItem="0">Cílový kanál
        </dropdownList>
      </presentation>
      <presentation id="Pol_DefaultRemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_RemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_DefaultCreateDesktopShortcut" />
      <presentation id="Pol_CreateDesktopShortcut" />
      <presentation id="Pol_RollbackToTargetVersion" />
      <presentation id="Pol_EdgePreview" />
      <presentation id="Pol_AllowSideBySideExperience" />
      <presentation id="Pol_DefaultAllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Zásada instalace</dropdownList>
      </presentation>
      <presentation id="Pol_AllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Zásada instalace</dropdownList>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>